src/integration-test/resources/ConfirmDeliveryIT/__files/test01_confirmDelivery/mappings/api-oep-confirm-delivery.json

{
	"request": {
		"method": "POST",
		"bodyPatterns": [
			{
				"equalToXml": "<?xml version=\"1.0\" encoding=\"UTF-8\" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><confirmDelivery xmlns=\"http://www.oeplatform.org/version/1.0/schemas/integration/callback\"><flowInstanceID>123</flowInstanceID><externalID><ID>1234567890</ID><System>TestSystem</System></externalID><delivered>true</delivered><logMessage>Test message</logMessage></confirmDelivery></SOAP-ENV:Body></SOAP-ENV:Envelope>"
			}
		],
		"urlPath": "/external-oepMock/api/callback"
	},
	"response": {
		"bodyFileName": "test01_confirmDelivery/responses/confirm-delivery.xml",
		"status": 200,
		"headers": {
			"Content-Type": "text/xml;charset=ISO-8859-1"
		}
	},
	"name": "api-oep-confirm-delivery"
}
